index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-29 Tue 12:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgedcb11f">Welcome</a></li>
<li><a href="#orgea74751">What will each folder have?</a></li>
<li><a href="#orgf3aff06">What Next</a>
<ul>
<li><a href="#orgff02989">Articles</a></li>
<li><a href="#org010d605">Books</a></li>
<li><a href="#org79489b4">Cloud</a></li>
<li><a href="#orge849eff">Web</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgedcb11f" class="outline-2">
<h2 id="orgedcb11f">Welcome</h2>
<div class="outline-text-2" id="text-orgedcb11f">
<p>
Welcome to my repository called notes. This repo will have notes about anything I wish to take notes on. This can be a YouTube video, a course, a book, a process, like how to wash a car properly, research papers, articles, technologies, etc. Many of the times, when I take down notes on whatever it may be, I either delete the files, throw out the paper, or simply take down bad notes.
</p>

<p>
I want to start something different. I want to build my "second brain", my garden of knowledge, or whatever you may call it. I've tried before. I've tried to build this "second brain" either by using OneNote, Notion, Obsidian, MediaWiki, or Confluence. However, each time, I overcomplicate it. I've spent countless hours researching the best workflow for taking down notes. I've tried to build folders for different categories, then subfolders for different subcategories, tried to interconnect my notes with each other, and I've tried to add tags to my notes. I realized, that was a waste of time because none of that seemed to work for me. In the end, I was left exhausted and without good notes.
</p>

<p>
Now, I'm going to take a different approach. For one, each book, course, video, article, research paper, whatever it may be, will have its own folder. I am going to try and organize my notes but at the same time avoid having so many nested folders. Second, I'm going to try and keep it simple. I will take down notes in plain text using Org-Mode in Emacs. Hopefully this new process works for me and hopefully I don't get stuck in this cycle where I am changing my process once more to take down notes.
</p>
</div>
</div>

<div id="outline-container-orgea74751" class="outline-2">
<h2 id="orgea74751">What will each folder have?</h2>
<div class="outline-text-2" id="text-orgea74751">
<p>
The goal is for each folder to correspond to a course, book, research paper, article, video, etc. If the video / book is long there may be folders or multiple files to separate the topics / chapters. However, I am not just going to take down notes. Notes are great but you need to do more to fully understand the material. So, in addition to notes, I am going to try to create how-to-wikis, projects, answer textbook questions, and more. Each folder will be more than just notes.
</p>

<p>
In addition, each folder will have an org-file and a HTML file. The org-file would be used to store the notes but the great thing about Org-Mode in Emacs is that you can create internal links and navigate between files. Emacs also has a great HTML export option which I will be using. Thus we will have two files per note: an org-file and a HTML file.
</p>

<p>
The HTML file will use the default export options of Emacs but the only difference is that I will be using <a href="https://bulma.io">Bulma</a> CSS to simply style my headings, paragraphs, etc. I will simply attach the Bulma's CSS file to the HTML file. Other than that no changes will be made to the HTML file.
</p>
</div>
</div>

<div id="outline-container-orgf3aff06" class="outline-2">
<h2 id="orgf3aff06">What Next</h2>
<div class="outline-text-2" id="text-orgf3aff06">
<p>
Please feel free to enter any folder, explore my projects and use my notes. Most projects will be small and thus will not have its own repo, but who knows, in the future a project may be expanded and have its own dedicated repo.
</p>

<p>
Depending on how you are navigating my notes (html, org, or Github) you can click on the internal links below to explore my notes.
</p>

<hr />
</div>

<div id="outline-container-orgff02989" class="outline-3">
<h3 id="orgff02989">Articles</h3>
<div class="outline-text-3" id="text-orgff02989">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-left">Subject</th>
<th scope="col" class="org-left">Html</th>
<th scope="col" class="org-left">Org</th>
<th scope="col" class="org-left">GitHub</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">What is Docker</td>
<td class="org-left">Alfredo</td>
<td class="org-left">Developer Technologies</td>
<td class="org-left"><a href="./Articles/What_is_Docker/000.Notes.html">html</a></td>
<td class="org-left"><a href="./Articles/What_is_Docker/000.Notes.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Articles/What_is_Docker">github</a></td>
<td class="org-left">Complete</td>
</tr>
</tbody>
</table>

<hr />
</div>
</div>

<div id="outline-container-org010d605" class="outline-3">
<h3 id="org010d605">Books</h3>
<div class="outline-text-3" id="text-org010d605">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Html</th>
<th scope="col" class="org-left">Org</th>
<th scope="col" class="org-left">GitHub</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">To Kill A Mockingbird</td>
<td class="org-left">Harper Lee</td>
<td class="org-left">Novel</td>
<td class="org-left"><a href="./Books/To_Kill_A_Mockingbird/000.Notes.html">html</a></td>
<td class="org-left"><a href="./Books/To_Kill_A_Mockingbird/000.Notes.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Books/To_Kill_A_Mockingbird">github</a></td>
<td class="org-left">In-Progress</td>
</tr>
</tbody>
</table>

<hr />
</div>
</div>

<div id="outline-container-org79489b4" class="outline-3">
<h3 id="org79489b4">Cloud</h3>
<div class="outline-text-3" id="text-org79489b4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-left">Html</th>
<th scope="col" class="org-left">Org</th>
<th scope="col" class="org-left">GitHub</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Introduction to Oracle Cloud Essentials</td>
<td class="org-left">Oracle University</td>
<td class="org-left"><a href="./Cloud/Introduction_to_Oracle_Cloud_Essentials/000.Home.html">html</a></td>
<td class="org-left"><a href="./Cloud/Introduction_to_Oracle_Cloud_Essentials/000.Home.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Cloud/Introduction_to_Oracle_Cloud_Essentials">github</a></td>
<td class="org-left">In-progress</td>
</tr>

<tr>
<td class="org-left">User's Guide for Oracle Business Intelligence Enterprise Edition</td>
<td class="org-left">Oracle Docs</td>
<td class="org-left"><a href="./Cloud/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/000.Home.html">html</a></td>
<td class="org-left"><a href="./Cloud/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/000.Home.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Cloud/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition">github</a></td>
<td class="org-left">In-progress</td>
</tr>
</tbody>
</table>

<hr />
</div>
</div>

<div id="outline-container-orge849eff" class="outline-3">
<h3 id="orge849eff">Web</h3>
<div class="outline-text-3" id="text-orge849eff">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Author</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Html</th>
<th scope="col" class="org-left">Org</th>
<th scope="col" class="org-left">GitHub</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Django Polls App</td>
<td class="org-left">Django Docs</td>
<td class="org-left">Django Tutorial</td>
<td class="org-left"><a href="./Web/Django_Polls_App/000.Notes.html">html</a></td>
<td class="org-left"><a href="./Web/Django_Polls_App/000.Notes.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Web/Django_Polls_App">github</a></td>
<td class="org-left">Complete</td>
</tr>

<tr>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
<td class="org-left">Jon Duckett</td>
<td class="org-left">Book</td>
<td class="org-left"><a href="Web/HTML_and_CSS_Design_and_Build_Websites/000.Home.html">html</a></td>
<td class="org-left"><a href="Web/HTML_and_CSS_Design_and_Build_Websites/000.Home.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites">github</a></td>
<td class="org-left">Complete</td>
</tr>

<tr>
<td class="org-left">JavaScript &amp; JQuery - Interactive Front-end Web Development</td>
<td class="org-left">Jon Duckett</td>
<td class="org-left">Book</td>
<td class="org-left"><a href="Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/000.Home.html">html</a></td>
<td class="org-left"><a href="Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development/000.Home.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Web/JavaScript_and_JQuery_Interactive_Frontend_Web_Development">github</a></td>
<td class="org-left">In-Progress</td>
</tr>

<tr>
<td class="org-left">The Complete 2024 Web Development Bootcamp</td>
<td class="org-left">Dr. Angela Yu</td>
<td class="org-left">Udemy Course</td>
<td class="org-left"><a href="Web/The_Complete_2024_Web_Development_Bootcamp/000.Home.html">html</a></td>
<td class="org-left"><a href="Web/The_Complete_2024_Web_Development_Bootcamp/000.Home.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Web/The_Complete_2024_Web_Development_Bootcamp">github</a></td>
<td class="org-left">In-progress</td>
</tr>

<tr>
<td class="org-left">The Web Developer Bootcamp 2024</td>
<td class="org-left">Colt Steele</td>
<td class="org-left">Udemy Course</td>
<td class="org-left"><a href="Web/The_Web_Developer_Bootcamp_2024/000.Home.html">html</a></td>
<td class="org-left"><a href="Web/The_Web_Developer_Bootcamp_2024/000.Home.html">org</a></td>
<td class="org-left"><a href="https://github.com/alfredo-mejia/notes/tree/main/Web/The_Web_Developer_Bootcamp_2024">github</a></td>
<td class="org-left">In-progress</td>
</tr>
</tbody>
</table>

<hr />
</div>
</div>
</div>
</div>
</body>
</html>
